{
  "_name_or_path": "roberta-large",
  "architectures": [
    "Seq2Table"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bipartite": true,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "context_representation": "decoder",
  "device": "cuda:0",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-05,
  "matching_method_train": "accurate",
  "max_dec_seq_length": 512,
  "max_enc_seq_length": 300,
  "max_position_embeddings": 514,
  "max_prompt_seq_length": 64,
  "max_span_length": 10000,
  "model_name_or_path": "roberta-large",
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50311
}
